# 2. Даны два числа. Показать большее и меньшее число
def Show_min_max(a,b):
    if a>b:
        print('max = ',a,'min = ',b)
    else:
        print('max = ',b,'min = ',a)

Show_min_max(7,9)     