#Вывести на экран числа от -N до N

a=8
print(list(range(-a,a+1)))
